## production: ses_to_sqs_email_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `module.ses_to_sqs_email_callbacks.aws_lambda_alias.this[0]`                          |
| update | `module.ses_to_sqs_email_callbacks.aws_cloudwatch_query_definition.lambda_statistics` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ses_to_sqs_email_callbacks.aws_cloudwatch_query_definition.lambda_statistics will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "lambda_statistics" {
        id                  = "05792e2f-dd4f-4001-9853-716f1d29f908"
      ~ log_group_names     = [
          ~ "aws_cloudwatch_log_group.this" -> "/aws/lambda/ses_to_sqs_email_callbacks",
        ]
      ~ name                = "Lambda Statistics - ses_to_sqs_email_callbacks" -> "Lambda Statistics / ses_to_sqs_email_callbacks"
        # (2 unchanged attributes hidden)
    }

  # module.ses_to_sqs_email_callbacks.aws_lambda_alias.this[0] will be created
  + resource "aws_lambda_alias" "this" {
      + arn              = (known after apply)
      + description      = "The most recently deployed version of the API"
      + function_name    = "ses_to_sqs_email_callbacks"
      + function_version = "$LATEST"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "latest"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_to_sqs_email_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_to_sqs_email_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_to_sqs_email_callbacks-500-errors-api[0]"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
